# Упражнение 1: Написать функцию с обработкой ошибок для преобразования строки в число
#
# Задание: Создать функцию convert_to_int(value), которая пытается преобразовать строку в целое число. Обработать случаи, когда преобразование невозможно, и когда возникает любое другое исключение.
#
# Пошаговая инструкция:
# Создайте функцию convert_to_int(value).
# Используйте блок try для попытки преобразования строки в целое число с помощью функции int().
# Обработайте исключение ValueError, выведя сообщение о невозможности преобразования.
# Обработайте любое другое исключение, выведя сообщение о неожиданной ошибке.
# Добавьте блок finally, который выведет сообщение о завершении попытки преобразования.
#
# Проверка:
# Протестируйте функцию с корректной строкой, например, "123".
# Протестируйте функцию с некорректной строкой, например, "abc".
# Протестируйте функцию с другим типом данных, например, списком [1, 2, 3].

def convert_to_int(value):
    try:
        print(f"Результат преобразования: {int(value)}")
    except ValueError:
        print(f"{value} не является целым числом")
    except Exception as ex:
        print(f"Неожиданное исключение: {ex}")
    finally:
        print("Преобразование закончено\n")

convert_to_int("123")
convert_to_int("abc")
convert_to_int([1, 2, 3])
